__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 96)           0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 96)           0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 96)           0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 96)           0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 96)           0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 96)           0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 96, 300)      8437500     input_1[0][0]                    
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 96, 50)       15000       input_4[0][0]                    
                                                                 input_5[0][0]                    
                                                                 input_6[0][0]                    
                                                                 input_7[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 96, 100)      4100        input_3[0][0]                    
__________________________________________________________________________________________________
Attention (SeqSelfAttention)    (None, 96, 300)      90001       embedding_1[0][0]                
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 96, 300)      0           embedding_3[0][0]                
                                                                 embedding_3[2][0]                
                                                                 embedding_2[0][0]                
                                                                 embedding_3[1][0]                
                                                                 embedding_3[3][0]                
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 96, 1000)     301000      Attention[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 96, 1000)     301000      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 96, 1000)     301000      Attention[0][0]                  
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 96, 1000)     0           dense_2[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 96, 1000)     0           dense_3[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 96, 2000)     0           multiply_1[0][0]                 
                                                                 multiply_2[0][0]                 
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 94, 500)      3000500     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 92, 250)      375250      conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 90, 100)      75100       conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 45, 100)      0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 4500)         0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 200)          900200      flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 100)          20100       dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 50)           5050        dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           510         dense_6[0][0]                    
==================================================================================================
Total params: 13,826,311
Trainable params: 5,388,811
Non-trainable params: 8,437,500
__________________________________________________________________________________________________
