__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 19)           0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 19)           0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 19)           0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 19)           0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 19)           0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 19)           0                                            
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 19, 1)        0           input_4[0][0]                    
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 19, 1)        0           input_6[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 19, 100)      4100        input_3[0][0]                    
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 19, 1)        0           input_5[0][0]                    
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 19, 1)        0           input_7[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 19, 300)      8437500     input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 19, 104)      0           reshape_1[0][0]                  
                                                                 reshape_3[0][0]                  
                                                                 embedding_2[0][0]                
                                                                 reshape_2[0][0]                  
                                                                 reshape_4[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 19, 500)      150500      embedding_1[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 19, 500)      52500       concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 19, 500)      150500      embedding_1[0][0]                
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 19, 500)      0           dense_2[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 19, 500)      0           dense_3[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 19, 500)      0           multiply_1[0][0]                 
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 19, 500)      0           multiply_2[0][0]                 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 19, 1000)     0           activation_1[0][0]               
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 17, 500)      1500500     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 16, 250)      1000250     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 15, 100)      500100      concatenate_2[0][0]              
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 1, 500)       0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1, 250)       0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 1, 100)       0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 500)          0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 250)          0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 100)          0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 850)          0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 100)          85100       concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 10)           1010        dense_4[0][0]                    
==================================================================================================
Total params: 11,882,060
Trainable params: 3,444,560
Non-trainable params: 8,437,500
__________________________________________________________________________________________________
